In [0]:
import numpy as np
import pandas as pd

In [15]:
data = pd.read_csv('sample_data/adult.data.csv')
data.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

In [16]:
data['sex'].value_counts()

Male      12875
Female     6359
Name: sex, dtype: int64

In [17]:
data.loc[data['sex'] == 'Female', 'age'].mean()

37.05016512030193

In [18]:
float((data['native-country'] == 'Germany').sum()) / data.shape[0]

0.004315275033794323

In [19]:
ages1 = data.loc[data['salary'] == '>50K', 'age']
ages2 = data.loc[data['salary'] == '<=50K', 'age']
print("The average age of the rich: {0} +- {1} years, poor - {2} +- {3} years.".format(
    round(ages1.mean()), round(ages1.std(), 1),
    round(ages2.mean()), round(ages2.std(), 1)))

The average age of the rich: 44 +- 10.4 years, poor - 37 +- 14.1 years.

In [20]:
data.loc[data['salary'] == '>50K', 'education'].unique() # No

array(['HS-grad', 'Masters', 'Bachelors', 'Some-college', 'Assoc-voc',
       'Doctorate', 'Prof-school', 'Assoc-acdm', '7th-8th', '12th',
       '10th', '11th', '9th', '5th-6th', '1st-4th'], dtype=object)

In [21]:
for (race, sex), sub_df in data.groupby(['race', 'sex']):
    print("Race: {0}, sex: {1}".format(race, sex))
    print(sub_df['age'].describe())

Race: Amer-Indian-Eskimo, sex: Female
count    70.000000
mean     36.314286
std      13.193699
min      17.000000
25%      25.000000
50%      35.000000
75%      42.000000
max      68.000000
Name: age, dtype: float64
Race: Amer-Indian-Eskimo, sex: Male
count    113.000000
mean      36.743363
std       12.036239
min       18.000000
25%       28.000000
50%       35.000000
75%       45.000000
max       82.000000
Name: age, dtype: float64
Race: Asian-Pac-Islander, sex: Female
count    205.000000
mean      36.234146
std       12.737693
min       17.000000
25%       26.000000
50%       35.000000
75%       45.000000
max       75.000000
Name: age, dtype: float64
Race: Asian-Pac-Islander, sex: Male
count    398.000000
mean      39.055276
std       12.899220
min       19.000000
25%       29.000000
50%       37.000000
75%       47.000000
max       90.000000
Name: age, dtype: float64
Race: Black, sex: Female
count    896.000000
mean      37.782366
std       12.798680
min       17.000000
25%       27.000000
50%       36.500000
75%       46.250000
max       90.000000
Name: age, dtype: float64
Race: Black, sex: Male
count    914.000000
mean      37.550328
std       12.972808
min       17.000000
25%       27.250000
50%       36.000000
75%       46.000000
max       90.000000
Name: age, dtype: float64
Race: Other, sex: Female
count    64.000000
mean     33.031250
std      11.162535
min      17.000000
25%      24.750000
50%      31.000000
75%      41.500000
max      66.000000
Name: age, dtype: float64
Race: Other, sex: Male
count    99.000000
mean     33.939394
std      11.742838
min      17.000000
25%      26.000000
50%      31.000000
75%      41.000000
max      77.000000
Name: age, dtype: float64
Race: White, sex: Female
count    5124.000000
mean       37.015027
std        14.405655
min        17.000000
25%        25.000000
50%        35.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64
Race: White, sex: Male
count    11351.000000
mean        39.588847
std         13.418037
min         17.000000
25%         29.000000
50%         38.000000
75%         49.000000
max         90.000000
Name: age, dtype: float64

In [22]:
data.loc[(data['sex'] == 'Male') &
     (data['marital-status'].isin(['Never-married', 
                                   'Separated', 
                                   'Divorced',
                                   'Widowed'])), 'salary'].value_counts()

<=50K    4507
>50K      416
<=5         1
Name: salary, dtype: int64

In [23]:
data.loc[(data['sex'] == 'Male') &
     (data['marital-status'].str.startswith('Married')), 'salary'].value_counts()

<=50K    4470
>50K     3481
Name: salary, dtype: int64

In [24]:
data['marital-status'].value_counts()

Married-civ-spouse       8821
Never-married            6321
Divorced                 2632
Widowed                   601
Separated                 599
Married-spouse-absent     245
Married-AF-spouse          15
Name: marital-status, dtype: int64

In [25]:
max_load = data['hours-per-week'].max()
print("Max time - {0} hours./week.".format(max_load))

num_workaholics = data[data['hours-per-week'] == max_load].shape[0]
print("Total number of such hard workers {0}".format(num_workaholics))

rich_share = float(data[(data['hours-per-week'] == max_load)
                 & (data['salary'] == '>50K')].shape[0]) / num_workaholics
print("Percentage of rich among them {0}%".format(int(100 * rich_share)))

Max time - 99 hours./week.
Total number of such hard workers 43
Percentage of rich among them 27%

In [26]:
for (country, salary), sub_df in data.groupby(['native-country', 'salary']):
    print(country, salary, round(sub_df['hours-per-week'].mean(), 2))

? <=50K 39.44
? >50K 46.09
Cambodia <=50K 41.89
Cambodia >50K 40.0
Canada <=50K 36.73
Canada >50K 47.07
China <=50K 37.08
China >50K 40.0
Columbia <=50K 39.66
Columbia >50K 50.0
Cuba <=50K 37.74
Cuba >50K 35.23
Dominican-Republic <=50K 41.2
Dominican-Republic >50K 47.0
Ecuador <=50K 36.29
Ecuador >50K 50.0
El-Salvador <=50K 36.35
El-Salvador >50K 45.0
England <=50K 40.85
England >50K 41.52
France <=50K 45.22
France >50K 61.0
Germany <=50K 38.31
Germany >50K 45.04
Greece <=50K 45.6
Greece >50K 48.75
Guatemala <=50K 39.1
Guatemala >50K 40.0
Haiti <=50K 34.24
Haiti >50K 40.0
Honduras <=50K 31.0
Honduras >50K 60.0
Hong <=50K 37.83
Hong >50K 52.5
Hungary <=50K 30.5
Hungary >50K 40.0
India <=50K 39.68
India >50K 44.1
Iran <=50K 41.28
Iran >50K 47.92
Ireland <=50K 39.83
Ireland >50K 50.0
Italy <=50K 37.04
Italy >50K 44.61
Jamaica <=50K 40.0
Jamaica >50K 42.57
Japan <=50K 40.92
Japan >50K 46.15
Laos <=50K 40.0
Mexico <=50K 39.79
Mexico >50K 48.27
Nicaragua <=50K 34.94
Nicaragua >50K 37.5
Outlying-US(Guam-USVI-etc) <=50K 43.14
Peru <=50K 35.2
Peru >50K 40.0
Philippines <=50K 38.86
Philippines >50K 42.63
Poland <=50K 39.97
Poland >50K 38.67
Portugal <=50K 39.58
Portugal >50K 42.0
Puerto-Rico <=50K 38.43
Puerto-Rico >50K 39.12
Scotland <=50K 36.67
South <=50K 41.77
South >50K 51.79
Taiwan <=50K 39.67
Taiwan >50K 47.73
Thailand <=50K 50.14
Thailand >50K 62.5
Trinadad&Tobago <=50K 35.57
Trinadad&Tobago >50K 40.0
United-States <=5 40.0
United-States <=50K 38.82
United-States >50K 45.31
Vietnam <=50K 38.38
Vietnam >50K 40.0
Yugoslavia <=50K 42.0
Yugoslavia >50K 40.0

In [27]:
pd.crosstab(data['native-country'], data['salary'], 
           values=data['hours-per-week'], aggfunc=np.mean).T

native-country          ?   Cambodia  ...    Vietnam  Yugoslavia
salary                                ...
<=5                   NaN        NaN  ...        NaN         NaN
<=50K           39.438247  41.888889  ...  38.378378        42.0
>50K            46.088889  40.000000  ...  40.000000        40.0

[3 rows x 41 columns]